# Польский калькулятор — 2
# Потренируемся в ОПН дальше. Операции, которые выполняются с одним значением,
# называются унарными, с двумя — бинарными, с тремя — тернарными. Давайте
# улучшим наш калькулятор, добавив поддержку следующих операций:
#     бинарные:
#         + (сложение),
#         - (вычитание),
#         * (умножение),
#         / (деление нацело; для отрицательных чисел работает по тем же
#            правилам, что и в Python);
#     унарные:
#         ~ (унарный минус — меняет знак),
#         ! (факториал),
#         # (клонирование — вернуть в стек значение дважды);
#     тернарные:
#         @ (возвращает в стек те же три значения, но в ином порядке:
#            второе, третье, первое).
# Формат ввода
# Вводится одна строка, содержащая разделённые пробелами целые числа и знаки
# операций. Вместе они составляют корректное выражение в обратной польской
# нотации, не содержащее деления на ноль и взятия факториала от отрицательного
# числа.
# Формат вывода
# Выводится одно целое число — результат вычисления выражения.
# Примечание
# В первом примере стек по мере прочтения строки выглядит так:
#     7
#     7 1
#     7 1 10
#     7 1 10 100
#     7 1 10 100 100
#     7 1 10 10000
#     7 10 10000 1
#     7 10 9999
#     7 10009
#     10016
#     -10016
# Пример 1
# Ввод
# 7 1 10 100 # * @ - + + ~
# Вывод
# -10016
# Пример 2
# Ввод
# 10 15 - 7 *
# Вывод
# -35
# Ограничение памяти
# 64.0 Мб
# Ограничение времени
# 1 с
# Ввод
# стандартный ввод или input.txt
# Вывод
# стандартный вывод или output.txt

stack = []
for s in input().split():
    if s in "+-*/":
        res = 0
        num2 = stack.pop()
        num1 = stack.pop()
        match s:
            case "+":
                res = num1 + num2
            case "-":
                res = num1 - num2
            case "*":
                res = num1 * num2
            case "/":
                res = num1 // num2
        stack.append(res)
    elif s in "~!#":
        res = 0
        num = stack.pop()
        match s:
            case "~":
                res = -num
            case "!":
                res = 1
                for i in range(2, num + 1):
                    res *= i
            case "#":
                res = num
                stack.append(num)
        stack.append(res)
    elif s == "@":
        num3 = stack.pop()
        num2 = stack.pop()
        num1 = stack.pop()
        stack.append(num2)
        stack.append(num3)
        stack.append(num1)
    else:
        stack.append(int(s))

print(stack.pop())
